Ran Plan for project: `localstack` dir: `apps/aws_localstack` workspace: `localstack`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ami.test must be replaced
-/+ resource "aws_ami" "test" {
      ~ architecture         = "None" -> "x86_64" # forces replacement
      ~ arn                  = "arn:aws:ec2:us-east-1::image/ami-7887e4db" -> (known after apply)
      - ena_support          = false -> null
      ~ hypervisor           = "xen" -> (known after apply)
      ~ id                   = "ami-7887e4db" -> (known after apply)
      ~ image_location       = "None" -> (known after apply)
      ~ image_owner_alias    = "amazon" -> (known after apply)
      ~ image_type           = "machine" -> (known after apply)
      - kernel_id            = "None" -> null # forces replacement
      + manage_ebs_snapshots = (known after apply)
        name                 = "my_ami"
      ~ owner_id             = "000000000000" -> (known after apply)
      + platform             = (known after apply)
      + platform_details     = (known after apply)
      ~ public               = false -> (known after apply)
      - ramdisk_id           = "ari-1a2b3c4d" -> null # forces replacement
      - root_device_name     = "/dev/sda1" -> null # forces replacement
      ~ root_snapshot_id     = "snap-873c20ab" -> (known after apply)
      + sriov_net_support    = "simple" # forces replacement
      - tags                 = {} -> null
      ~ tags_all             = {} -> (known after apply)
      + usage_operation      = (known after apply)
      ~ virtualization_type  = "None" -> "paravirtual" # forces replacement

      - ebs_block_device {
          - delete_on_termination = false -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - snapshot_id           = "snap-873c20ab" -> null
          - throughput            = 0 -> null
          - volume_size           = 15 -> null
          - volume_type           = "standard" -> null
        }
    }

  # aws_instance.my_instance must be replaced
-/+ resource "aws_instance" "my_instance" {
      ~ ami                                  = "ami-7887e4db" # forces replacement -> (known after apply) # forces replacement
      ~ arn                                  = "arn:aws:ec2:us-east-1::instance/i-32ce3a5c041ff6cd8" -> (known after apply)
      ~ associate_public_ip_address          = false -> (known after apply)
      ~ availability_zone                    = "us-east-1e" -> (known after apply)
      + cpu_core_count                       = (known after apply)
      + cpu_threads_per_core                 = (known after apply)
      ~ disable_api_stop                     = false -> (known after apply)
      ~ disable_api_termination              = false -> (known after apply)
      ~ ebs_optimized                        = false -> (known after apply)
      + host_id                              = (known after apply)
      + host_resource_group_arn              = (known after apply)
      + iam_instance_profile                 = (known after apply)
      ~ id                                   = "i-32ce3a5c041ff6cd8" -> (known after apply)
      ~ instance_initiated_shutdown_behavior = "stop" -> (known after apply)
      + instance_lifecycle                   = (known after apply)
      ~ instance_state                       = "running" -> (known after apply)
      ~ ipv6_address_count                   = 0 -> (known after apply)
      ~ ipv6_addresses                       = [] -> (known after apply)
      ~ monitoring                           = false -> (known after apply)
      + outpost_arn                          = (known after apply)
      + password_data                        = (known after apply)
      + placement_group                      = (known after apply)
      ~ placement_partition_number           = 0 -> (known after apply)
      ~ primary_network_interface_id         = "eni-9528e98b" -> (known after apply)
      ~ private_dns                          = "ip-10-0-1-4.ec2.internal" -> (known after apply)
      ~ private_ip                           = "10.0.1.4" -> (known after apply)
      ~ public_dns                           = "None" -> (known after apply)
      + public_ip                            = (known after apply)
      ~ secondary_private_ips                = [] -> (known after apply)
      ~ security_groups                      = [] -> (known after apply)
      + spot_instance_request_id             = (known after apply)
      - tags                                 = {} -> null
      ~ tags_all                             = {} -> (known after apply)
      ~ tenancy                              = "default" -> (known after apply)
      + user_data                            = (known after apply)
      + user_data_base64                     = (known after apply)
      ~ vpc_security_group_ids               = [] -> (known after apply)
        # (6 unchanged attributes hidden)

      - root_block_device {
          - delete_on_termination = true -> null
          - device_name           = "/dev/sda1" -> null
          - encrypted             = false -> null
          - iops                  = 0 -> null
          - tags                  = {} -> null
          - throughput            = 0 -> null
          - volume_id             = "vol-02a8c04b" -> null
          - volume_size           = 8 -> null
          - volume_type           = "gp2" -> null
        }
    }

  # aws_s3_bucket.bucket will be created
+ resource "aws_s3_bucket" "bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "my_bucket"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

Plan: 3 to add, 0 to change, 2 to destroy.
```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p localstack`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.mvaldes.dev/lock?id=mvaldes14%252Fterraform%252Fapps%252Faws_localstack%252Flocalstack)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p localstack`
</details>
Plan: 3 to add, 0 to change, 2 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`